sorru94/astarte-device-sdk-esp32/src/astarte_device.c
astarte_err_t astarte_device_stream_aggregate_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path_prefix, const void *bson_document,
    uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_document(bson, "v", bson_document);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path_prefix, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

astarte_err_t astarte_device_stream_double(astarte_device_handle_t device,
    const char *interface_name, const char *path, double value, int qos)
{
    return astarte_device_stream_double_with_timestamp(
        device, interface_name, path, value, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_integer(astarte_device_handle_t device,
    const char *interface_name, const char *path, int32_t value, int qos)
{
    return astarte_device_stream_integer_with_timestamp(
        device, interface_name, path, value, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_longinteger(astarte_device_handle_t device,
    const char *interface_name, const char *path, int64_t value, int qos)
{
    return astarte_device_stream_longinteger_with_timestamp(
        device, interface_name, path, value, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_boolean(astarte_device_handle_t device,
    const char *interface_name, const char *path, bool value, int qos)
{
    return astarte_device_stream_boolean_with_timestamp(
        device, interface_name, path, value, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_string(astarte_device_handle_t device,
    const char *interface_name, const char *path, const char *value, int qos)
{
    return astarte_device_stream_string_with_timestamp(
        device, interface_name, path, value, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_binaryblob(astarte_device_handle_t device,
    const char *interface_name, const char *path, void *value, size_t size, int qos)
{
    return astarte_device_stream_binaryblob_with_timestamp(
        device, interface_name, path, value, size, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_datetime(astarte_device_handle_t device,
    const char *interface_name, const char *path, int64_t value, int qos)
{
    return astarte_device_stream_datetime_with_timestamp(
        device, interface_name, path, value, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_stream_aggregate(astarte_device_handle_t device,
    const char *interface_name, const char *path_prefix, const void *bson_document, int qos)
{
    return astarte_device_stream_aggregate_with_timestamp(
        device, interface_name, path_prefix, bson_document, ASTARTE_INVALID_TIMESTAMP, qos);
}

astarte_err_t astarte_device_set_double_property(
    astarte_device_handle_t device, const char *interface_name, const char *path, double value)
{
    return astarte_device_stream_double(device, interface_name, path, value, 2);
}

astarte_err_t astarte_device_set_integer_property(
    astarte_device_handle_t device, const char *interface_name, const char *path, int32_t value)
{
    return astarte_device_stream_integer(device, interface_name, path, value, 2);
}

astarte_err_t astarte_device_set_longinteger_property(
    astarte_device_handle_t device, const char *interface_name, const char *path, int64_t value)
{
    return astarte_device_stream_longinteger(device, interface_name, path, value, 2);
}

astarte_err_t astarte_device_set_boolean_property(
    astarte_device_handle_t device, const char *interface_name, const char *path, bool value)
{
    return astarte_device_stream_boolean(device, interface_name, path, value, 2);
}

astarte_err_t astarte_device_set_string_property(
    astarte_device_handle_t device, const char *interface_name, const char *path, const char *value)
{
    return astarte_device_stream_string(device, interface_name, path, value, 2);
}

astarte_err_t astarte_device_set_binaryblob_property(astarte_device_handle_t device,
    const char *interface_name, const char *path, void *value, size_t size)
{
    return astarte_device_stream_binaryblob(device, interface_name, path, value, size, 2);
}

astarte_err_t astarte_device_set_datetime_property(
    astarte_device_handle_t device, const char *interface_name, const char *path, int64_t value)
{
    return astarte_device_stream_datetime(device, interface_name, path, value, 2);
}

astarte_err_t astarte_device_unset_path(
    astarte_device_handle_t device, const char *interface_name, const char *path)
{
    return publish_data(device, interface_name, path, "", 0, 2);
}

bool astarte_device_is_connected(astarte_device_handle_t device)
{
    return device->connected;
}

char *astarte_device_get_encoded_id(astarte_device_handle_t device)
{
    return device->encoded_hwid;
}

static astarte_err_t retrieve_credentials(astarte_pairing_config_t *pairing_config)
{
    astarte_err_t ret = ASTARTE_ERR;
    char *cert_pem = NULL;
    char *csr = calloc(CSR_LENGTH, sizeof(char));
    if (!csr) {
        ret = ASTARTE_ERR_OUT_OF_MEMORY;
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto exit;
    }
    ret = astarte_credentials_get_csr(csr, CSR_LENGTH);
    if (ret != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_csr");
        goto exit;
    }

    cert_pem = calloc(CERT_LENGTH, sizeof(char));
    if (!cert_pem) {
        ret = ASTARTE_ERR_OUT_OF_MEMORY;
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto exit;
    }
    ret = astarte_pairing_get_mqtt_v1_credentials(pairing_config, csr, cert_pem, CERT_LENGTH);
    if (ret != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_mqtt_v1_credentials");
        goto exit;
    } else {
        ESP_LOGD(TAG, "Got credentials");
    }

    ret = astarte_credentials_save_certificate(cert_pem);
    if (ret != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_mqtt_v1_credentials");
        goto exit;
    } else {
        ESP_LOGD(TAG, "Certificate saved");
    }

    ret = ASTARTE_OK;

