sorru94/astarte-device-sdk-esp32/src/astarte_device.c
    while (storage_err == ASTARTE_STORAGE_ERR_OK) {
        // Fetch property len
        size_t interface_name_len = 0;
        size_t path_len = 0;
        size_t value_len = 0;
        storage_err = astarte_storage_iterator_get_property(
            &storage_iterator, NULL, &interface_name_len, NULL, &path_len, NULL, &value_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error preparing to get one of the properties %d.", storage_err);
            astarte_storage_close(storage_handle);
            goto end;
        }
        // Allocate memory for property data
        interface_name = calloc(interface_name_len, sizeof(char));
        path = calloc(path_len, sizeof(char));
        value = calloc(value_len, sizeof(uint8_t));
        if ((interface_name == NULL) || (path == NULL) || (value == NULL)) {
            ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
            astarte_storage_close(storage_handle);
            goto end;
        }
        // Fetch property content
        storage_err = astarte_storage_iterator_get_property(&storage_iterator, interface_name,
            &interface_name_len, path, &path_len, value, &value_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error getting one of the properties %d.", storage_err);
            astarte_storage_close(storage_handle);
            goto end;
        }

        bool advance_iterator = true;
        // If property is not in introspection anymore, delete it from storage
        if (!interface_is_in_introspection(device, interface_name)) {
            // Check if this is the last iterable item
            bool has_next = false;
            storage_err = astarte_storage_iterator_peak(&storage_iterator, &has_next);
            if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                ESP_LOGE(TAG, "Error peaking next property: %d.", storage_err);
                astarte_storage_close(storage_handle);
                goto end;
            }
            // Delete the property
            storage_err = astarte_storage_delete_property(storage_handle, interface_name, path);
            if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                ESP_LOGE(TAG, "Error deleting the property  %d.", storage_err);
                astarte_storage_close(storage_handle);
                goto end;
            }
            // If the deleted iterm was the last one, break the loop here
            if (!has_next) {
                break;
            }
            // Prevent the iterator from advancing
            advance_iterator = false;
        }
        // If property is device owned send it to Astarte
        else if (interface_is_device_owned(device, interface_name)) {
            // Assuming that since the property is present in storage the size of the value
            // has already been checked and does not exceed the max value for an integer.
            publish_data(device, interface_name, path, value, (int) value_len, 2);

            // Get the combined interface_name and path for the property
            size_t property_full_path_len = interface_name_len + path_len - 1;
            char *property_full_path = calloc(property_full_path_len, sizeof(char));
            strncat(strncpy(property_full_path, interface_name, interface_name_len), path,
                path_len - 1);

            // Store the property full path in a temporary set
            astarte_linked_list_item_t list_item
                = { .value = property_full_path, .value_len = property_full_path_len };
            astarte_err_t list_err = astarte_linked_list_append(&list_handle, list_item);
            if (list_err != ASTARTE_OK) {
                ESP_LOGE(TAG, "Error adding a property name to the set %s.",
                    astarte_err_to_name(list_err));
                goto end;
            }
        }
        // Free memory of property data
        free(interface_name);
        interface_name = NULL;
        free(path);
        path = NULL;
        free(value);
        value = NULL;
        // Advance the iterator if required
        if (advance_iterator) {
            storage_err = astarte_storage_iterator_advance(&storage_iterator);
            if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                if (storage_err != ASTARTE_STORAGE_ERR_NOT_FOUND) {
                    ESP_LOGE(TAG, "Error advancing properties iterator %d.", storage_err);
                }
                break;
            }
        }
    }

    // Close astarte storage
    astarte_storage_close(storage_handle);

    // Send purge device properties
    send_purge_device_properties(device, &list_handle);

end:
    // Destroy the set
    astarte_linked_list_destroy_and_release(&list_handle);

    // Free all data
    free(interface_name);
    free(path);
    free(value);
}

static void send_purge_device_properties(
    astarte_device_handle_t device, astarte_linked_list_handle_t *list_handle)
{
    // Pointer to string that will contain a list of interface names separated by the ';' char
    char *properties_list = NULL;
    // Size of the string contained in properties_list including the '\0' terminating char
    size_t properties_list_len = 0;

    char *payload = NULL;
    size_t payload_len = 0;

    // Create the uncompressed properties string
    astarte_linked_list_item_t property_path;
    while (astarte_linked_list_remove_tail(list_handle, &property_path) != ASTARTE_ERR_NOT_FOUND) {
        // Append interface name to the ';' separated string
        // Both lengths include a +1 for the '\0' char
        // We do a simple sum since we need an extra char to store the ';'
        size_t ext_properties_list_len = properties_list_len + property_path.value_len;
        char *ext_properties_list = (char *) realloc(properties_list, ext_properties_list_len);
        if (ext_properties_list == NULL) {
            ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
            free(property_path.value);
            // Deallocate everything from the set
            while (astarte_linked_list_remove_tail(list_handle, &property_path)
                != ASTARTE_ERR_NOT_FOUND) {
                free(property_path.value);
            }
            goto end;
        }
        if (properties_list_len == 0) {
            // Set the first char to '\0' for the first interface name
            *ext_properties_list = '\0';
        } else {
            // Append a ';' for any subsequent interface name
            strcat(ext_properties_list, ";");
        }
        // Append the new interface name
        properties_list = strcat(ext_properties_list, property_path.value);
        properties_list_len = ext_properties_list_len;

        free(property_path.value);
    }

    // Estimate compression result size and payload size
    size_t compression_input_len = (properties_list) ? (properties_list_len - 1) : 0;
    uLongf compressed_len = compressBound(compression_input_len);
    // Allocate enough memory for the payload
    payload_len = 4 + compressed_len;
    payload = calloc(payload_len, sizeof(char));
    if (payload == NULL) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto end;
    }
    // Fill the first 32 bits of the payload
    uint32_t *payload_uint32 = (uint32_t *) payload;
    *payload_uint32 = __builtin_bswap32(compression_input_len);
    // Perform the compression and store result in the payload
    int compress_res = astarte_zlib_compress((char unsigned *) &payload[4], &compressed_len,
        (char unsigned *) properties_list, compression_input_len);
    if (compress_res != Z_OK) {
        ESP_LOGE(TAG, "Compression error %d.", compress_res);
        goto end;
    }
    // 'astarte_zlib_compress' updates 'compressed_len' to the actual size of the compressed data
    payload_len = 4 + compressed_len;
    // Check if payload is not too large for a MQTT message
    if (payload_len > INT_MAX) {
        // MQTT supports sending a maximum payload length of INT_MAX
        ESP_LOGE(TAG, "Purge properties payload is too long for a single MQTT message.");
        goto end;
    }

    // Compose MQTT topic
    char topic[TOPIC_LENGTH];
    int ret = snprintf(topic, TOPIC_LENGTH, "%s/control/producer/properties", device->device_topic);
    if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        goto end;
    }
    // Set constant for MQTT QoS
    const int qos = 2;
    // Publish MQTT message
    ESP_LOGD(TAG, "Sending purge properties to: '%s', with uncompressed content: '%s'", topic,
        (properties_list) ? properties_list : "");
    esp_mqtt_client_publish(device->mqtt_client, topic, payload, (int) payload_len, qos, 0);

end:
    free(properties_list);
    free(payload);
}

