sorru94/astarte-device-sdk-esp32/src/astarte_device.c
static void on_certificate_error(astarte_device_handle_t device)
{
    if (has_connectivity()) {
        ESP_LOGW(TAG, "Certificate error, notifying the reinit task");
        xTaskNotify(device->reinit_task_handle, NOTIFY_REINIT, eSetBits);
    } else {
        ESP_LOGD(TAG, "TLS error due to missing connectivity, ignoring");
        // Do nothing, the mqtt client will try to connect again
    }
}

static void mqtt_event_handler(
    void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
    (void) base;

    esp_mqtt_event_handle_t event = event_data;
    astarte_device_handle_t device = (astarte_device_handle_t) handler_args;
    switch ((esp_mqtt_event_id_t) event_id) {
        case MQTT_EVENT_BEFORE_CONNECT:
            ESP_LOGD(TAG, "MQTT_EVENT_BEFORE_CONNECT");
            break;

        case MQTT_EVENT_CONNECTED:
            ESP_LOGD(TAG, "MQTT_EVENT_CONNECTED");
            on_connected(device, event->session_present);
            break;

        case MQTT_EVENT_DISCONNECTED:
            ESP_LOGD(TAG, "MQTT_EVENT_DISCONNECTED");
            on_disconnected(device);
            break;

        case MQTT_EVENT_SUBSCRIBED:
            ESP_LOGD(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
            break;

        case MQTT_EVENT_UNSUBSCRIBED:
            ESP_LOGD(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
            break;

        case MQTT_EVENT_PUBLISHED:
            ESP_LOGD(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
            break;

        case MQTT_EVENT_DATA:
            ESP_LOGD(TAG, "MQTT_EVENT_DATA");
            on_incoming(device, event->topic, event->topic_len, event->data, event->data_len);
            break;

        case MQTT_EVENT_ERROR:
            ESP_LOGD(TAG, "MQTT_EVENT_ERROR");
            if (event->error_handle->error_type == MQTT_ERROR_TYPE_ESP_TLS) {
                on_certificate_error(device);
            }
            break;

        default:
            // Handle MQTT_EVENT_ANY introduced in esp-idf 3.2
            break;
    }
}

static bool interface_is_in_introspection(astarte_device_handle_t device, const char *name)
{
    astarte_linked_list_iterator_t list_iter;
    astarte_err_t iter_err = astarte_linked_list_iterator_init(&device->introspection, &list_iter);
    while (iter_err != ASTARTE_ERR_NOT_FOUND) {
        astarte_linked_list_item_t list_item;
        astarte_linked_list_iterator_get_item(&list_iter, &list_item);

        const astarte_interface_t *interface = list_item.value;

        if (strcmp(interface->name, name) == 0) {
            return true;
        }

        iter_err = astarte_linked_list_iterator_advance(&list_iter);
    }
    return false;
}

static bool interface_is_property(astarte_device_handle_t device, const char *name)
{
    astarte_linked_list_iterator_t list_iter;
    astarte_err_t iter_err = astarte_linked_list_iterator_init(&device->introspection, &list_iter);
    while (iter_err != ASTARTE_ERR_NOT_FOUND) {
        astarte_linked_list_item_t list_item;
        astarte_linked_list_iterator_get_item(&list_iter, &list_item);

        const astarte_interface_t *interface = list_item.value;

        if (strcmp(interface->name, name) == 0) {
            return interface->type == TYPE_PROPERTIES;
        }

        iter_err = astarte_linked_list_iterator_advance(&list_iter);
    }
    return false;
}

static bool interface_is_device_owned(astarte_device_handle_t device, const char *name)
{
    astarte_linked_list_iterator_t list_iter;
    astarte_err_t iter_err = astarte_linked_list_iterator_init(&device->introspection, &list_iter);
    while (iter_err != ASTARTE_ERR_NOT_FOUND) {
        astarte_linked_list_item_t list_item;
        astarte_linked_list_iterator_get_item(&list_iter, &list_item);

        const astarte_interface_t *interface = list_item.value;

        if (strcmp(interface->name, name) == 0) {
            return interface->ownership == OWNERSHIP_DEVICE;
        }

        iter_err = astarte_linked_list_iterator_advance(&list_iter);
    }
    return false;
}
